Revit 2027 API
Selection.GetElementIds Method
 Returns the ids of the elements that are currently selected within the project. The selection may not be complete. See GetReferences for more options.
Namespace: Autodesk.Revit.UI.Selection
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetElementIds()
Public Function GetElementIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetElementIds()
member GetElementIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The collection containing the ids of the selected elements.
See Also
Reference
Selection Class
Autodesk.Revit.UI.Selection Namespace